Revit 2024 API
Form.GetPathCurveIndexByCurveReference Method
Given a reference to certain curve in the path, return its index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int GetPathCurveIndexByCurveReference(
	Reference curveReference
)
Visual Basic
Public Function GetPathCurveIndexByCurveReference ( _
	curveReference As Reference _
) As Integer
Visual C++
public:
int GetPathCurveIndexByCurveReference(
	Reference^ curveReference
)
Parameters
curveReference
Type: Autodesk.Revit.DB.Reference
Reference to the curve in path
See Also
Form Class
Autodesk.Revit.DB Namespace